# AsElementId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Parameter..::..AsElementId Method
Parameter Class See Also
---
Provides access to the Autodesk::Revit::DB::ElementId^ stored within the parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId AsElementId()
```

Visual Basic
---
```text
Public Function AsElementId As ElementId
```

Visual C++
---
```text
public:
ElementId^ AsElementId()
```

# ### Return Value
The Autodesk::Revit::DB::ElementId^ contained in the parameter.
# Remarks
The AsAutodesk::Revit::DB::ElementId^ method should only be used if the StorageType property returns that the internal contents of the parameter is an ElementId.
# See Also
Parameter Class
Autodesk.Revit.DB Namespace